ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/cs.c
        }

        return CLKFrequency;
}

//*****************************************************************************
//
//! \brief Compute the clock frequency given the clock source and divider
//!
//! \param CLKSource
//!        Valid values are:
//!        - \b CS_CLOCK_DIVIDER_1 - [Default for ACLK]
//!        - \b CS_CLOCK_DIVIDER_2
//!        - \b CS_CLOCK_DIVIDER_4
//!        - \b CS_CLOCK_DIVIDER_8 - [Default for SMCLK and MCLK]
//!        - \b CS_CLOCK_DIVIDER_16
//!        - \b CS_CLOCK_DIVIDER_32
//! \param CLKSourceDivider
//!        Valid values are:
//!        - \b CS_CLOCK_DIVIDER_1 - [Default for ACLK]
//!        - \b CS_CLOCK_DIVIDER_2
//!        - \b CS_CLOCK_DIVIDER_4
//!        - \b CS_CLOCK_DIVIDER_8 - [Default for SMCLK and MCLK]
//!        - \b CS_CLOCK_DIVIDER_16
//!        - \b CS_CLOCK_DIVIDER_32
//!
//! \return Calculated clock frequency in Hz
//
//*****************************************************************************
static uint32_t privateCSAComputeCLKFrequency(uint16_t CLKSource,
                                              uint16_t CLKSourceDivider
                                              )
{
        uint32_t CLKFrequency;
        uint8_t CLKSourceFrequencyDivider = 1;
        uint8_t i = 0;

        // Determine Frequency divider
        for ( i = 0; i < CLKSourceDivider; i++)
                CLKSourceFrequencyDivider *= 2;

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        // Determine clock source based on CLKSource
        switch (CLKSource) {

        // If LFXT is selected as clock source
        case SELM__LFXTCLK:
                CLKFrequency = (CS_LFXTClockFrequency /
                                CLKSourceFrequencyDivider);

                //Check if LFXTOFFG is not set. If fault flag is set
                //VLO is used as source clock
                if (HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG) {
                        HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG);
                        //Clear OFIFG fault flag
                        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                        if (HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG)
                                CLKFrequency = CS_LFMODCLK_FREQUENCY;
                }
                break;

        case SELM__VLOCLK:
                CLKFrequency =
                        (CS_VLOCLK_FREQUENCY / CLKSourceFrequencyDivider);
                break;

        case SELM__LFMODOSC:
                CLKFrequency =
                        (CS_LFMODCLK_FREQUENCY / CLKSourceFrequencyDivider);

                break;

        case SELM__DCOCLK:
                CLKFrequency =
                        privateCSASourceClockFromDCO( CLKSourceFrequencyDivider);

                break;

        case SELM__MODOSC:
                CLKFrequency =
                        (CS_MODCLK_FREQUENCY / CLKSourceFrequencyDivider);

                break;

        case SELM__HFXTCLK:
                CLKFrequency =
                        (CS_HFXTClockFrequency / CLKSourceFrequencyDivider);

                if (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {

                        HWREG8(CS_BASE + OFS_CSCTL5) &=  ~HFXTOFFG;
                        //Clear OFIFG fault flag
                        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
                }

                if (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG)
                        CLKFrequency = CS_MODCLK_FREQUENCY;
                break;
        }

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

        return CLKFrequency;
}

//*****************************************************************************
//
//! \brief Sets the external clock source
//!
//! This function sets the external clock sources LFXT and HFXT crystal
//! oscillator frequency values. This function must be called if an external
//! crystal LFXT or HFXT is used and the user intends to call CS_getMCLK,
//! CS_getSMCLK, CS_getACLK and CS_LFXTStart, CS_LFXTByPass,
//! CS_LFXTStartWithTimeout, CS_LFXTByPassWithTimeout, CS_HFXTStart,
//! CS_HFXTByPass, CS_HFXTStartWithTimeout, CS_HFXTByPassWithTimeout.
//!
//! \param LFXTCLK_frequency is the LFXT crystal frequencies in Hz
//! \param HFXTCLK_frequency is the HFXT crystal frequencies in Hz
//!
//! \return None
//
//*****************************************************************************
void CS_setExternalClockSource(uint32_t LFXTCLK_frequency,
                               uint32_t HFXTCLK_frequency
                               )
{
        CS_LFXTClockFrequency = LFXTCLK_frequency;
        CS_HFXTClockFrequency = HFXTCLK_frequency;
}

//*****************************************************************************
//
//! \brief Initializes clock signal
//!
//! This function initializes each of the clock signals. The user must ensure
//! that this function is called for each clock signal. If not, the default
//! state is assumed for the particular clock signal. Refer to MSP430ware
//! documentation for CS module or Device Family User's Guide for details of
//! default clock signal states.
//!
//! \param selectedClockSignal Selected clock signal
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//! \param clockSource is the selected clock signal
//!        Valid values are:
//!        - \b CS_VLOCLK_SELECT
//!        - \b CS_DCOCLK_SELECT - [Not available for ACLK]
//!        - \b CS_LFXTCLK_SELECT
//!        - \b CS_HFXTCLK_SELECT - [Not available for ACLK]
//!        - \b CS_LFMODOSC_SELECT
//!        - \b CS_MODOSC_SELECT - [Not available for ACLK]
//! \param clockSourceDivider is the selected clock divider to calculate clock
//!        signal from clock source.
//!        Valid values are:
//!        - \b CS_CLOCK_DIVIDER_1 - [Default for ACLK]
//!        - \b CS_CLOCK_DIVIDER_2
//!        - \b CS_CLOCK_DIVIDER_4
//!        - \b CS_CLOCK_DIVIDER_8 - [Default for SMCLK and MCLK]
//!        - \b CS_CLOCK_DIVIDER_16
//!        - \b CS_CLOCK_DIVIDER_32
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL3 register and bits of
//! \b CSCTL2 register.
//!
//! \return None
//
//*****************************************************************************
void CS_clockSignalInit(uint8_t selectedClockSignal,
                        uint16_t clockSource,
                        uint16_t clockSourceDivider
                        )
{

        //Verify User has selected a valid Frequency divider
        assert(
                (CS_CLOCK_DIVIDER_1 == clockSourceDivider) ||
                (CS_CLOCK_DIVIDER_2 == clockSourceDivider) ||
                (CS_CLOCK_DIVIDER_4 == clockSourceDivider) ||
                (CS_CLOCK_DIVIDER_8 == clockSourceDivider) ||
                (CS_CLOCK_DIVIDER_16 == clockSourceDivider) ||
                (CS_CLOCK_DIVIDER_32 == clockSourceDivider)
                );

