ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/cs.c
        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        //If the drive setting is not already set to maximum
        //Set it to max for LFXT startup
        if ((HWREG16(CS_BASE + OFS_CSCTL4) & LFXTDRIVE_3) != LFXTDRIVE_3)
                //Highest drive setting for LFXTstartup
                HWREG16(CS_BASE + OFS_CSCTL4_L) |= LFXTDRIVE1_L + LFXTDRIVE0_L;

        HWREG16(CS_BASE + OFS_CSCTL4) &= ~LFXTBYPASS;

        while ((HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG) && --timeout) {
                //Clear OSC fault Flags fault flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG);

                // Clear the global fault flag. In case the LFXT caused the global fault
                // flag to get set this will clear the global error condition. If any
                // error condition persists, global flag will get again.
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

        }

        if (timeout) {

                //set requested Drive mode
                HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                                  ~(LFXTDRIVE_3)
                                                  ) |
                                                (lfxtdrive);
                //Switch ON LFXT oscillator
                HWREG16(CS_BASE + OFS_CSCTL4) &= ~LFXTOFF;
                // Lock CS control register
                HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
                return STATUS_SUCCESS;
        } else {
                // Lock CS control register
                HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
                return STATUS_FAIL;
        }
}

//*****************************************************************************
//
//! \brief Bypass the LFXT crystal oscillator with timeout.
//!
//! Bypasses the LFXT crystal oscillator with timeout. Loops until all
//! oscillator fault flags are cleared or until a timeout counter is
//! decremented and equals to zero. NOTE: User must call
//! CS_setExternalClockSource to set frequency of external clocks before
//! calling this function.
//!
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_bypassLFXTWithTimeout(uint32_t timeout
                              )
{
        assert(CS_LFXTClockFrequency != 0);

        assert(CS_LFXTClockFrequency < LFXT_FREQUENCY_THRESHOLD);

        assert(timeout > 0);

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        // Set LFXT in LF mode Switch off LFXT oscillator and enable BYPASS mode
        HWREG16(CS_BASE + OFS_CSCTL4) |= (LFXTBYPASS + LFXTOFF);

        while ((HWREG8(CS_BASE + OFS_CSCTL5) & LFXTOFFG) && --timeout) {
                //Clear OSC fault Flags fault flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG);

                // Clear the global fault flag. In case the LFXT caused the global fault
                // flag to get set this will clear the global error condition. If any
                // error condition persists, global flag will get again.
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

        }

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

        if (timeout)
                return STATUS_SUCCESS;
        else
                return STATUS_FAIL;
}

//*****************************************************************************
//
//! \brief Stops the LFXT oscillator using the LFXTOFF bit.
//!
//!
//! Modified bits of \b CSCTL4 register.
//!
//! \return None
//
//*****************************************************************************
void CS_LFXTOff(void)
{
        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        //Switch off LFXT oscillator
        HWREG16(CS_BASE + OFS_CSCTL4) |= LFXTOFF;

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Starts the HFXFT crystal
//!
//! Initializes the HFXT crystal oscillator, which supports crystal frequencies
//! between 0 MHz and 24 MHz, depending on the selected drive strength. Loops
//! until all oscillator fault flags are cleared, with no timeout. See the
//! device-specific data sheet for appropriate drive settings. NOTE: User must
//! call CS_setExternalClockSource to set frequency of external clocks before
//! calling this function.
//!
//! \param hfxtdrive is the target drive strength for the HFXT crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_HFXTDRIVE_4MHZ_8MHZ
//!        - \b CS_HFXTDRIVE_8MHZ_16MHZ
//!        - \b CS_HFXTDRIVE_16MHZ_24MHZ
//!        - \b CS_HFXTDRIVE_24MHZ_32MHZ [Default]
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG1 register.
//!
//! \return None
//
//*****************************************************************************
void CS_HFXTStart(uint16_t hfxtdrive
                  )
{
        assert(CS_HFXTClockFrequency != 0);

        assert((hfxtdrive == CS_HFXTDRIVE_4MHZ_8MHZ  ) ||
               (hfxtdrive == CS_HFXTDRIVE_8MHZ_16MHZ ) ||
               (hfxtdrive == CS_HFXTDRIVE_16MHZ_24MHZ ) ||
               (hfxtdrive == CS_HFXTDRIVE_24MHZ_32MHZ ));

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        //Disable HFXTBYPASS mode and Switch on HFXT oscillator
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTBYPASS;

        //If HFFrequency is 16MHz or above
        if (CS_HFXTClockFrequency > 16000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_3;
        //If HFFrequency is between 8MHz and 16MHz
        else if (CS_HFXTClockFrequency > 8000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_2;
        //If HFFrequency is between 0MHz and 4MHz
        else if (CS_HFXTClockFrequency < 4000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_0;
        //If HFFrequency is between 4MHz and 8MHz
        else
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_1;

        while (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {
                //Clear OSC flaut Flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }

        HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                          ~(CS_HFXTDRIVE_24MHZ_32MHZ)
                                          ) |
                                        (hfxtdrive);

