ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/cs.c
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTOFF;

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Bypasses the HFXT crystal oscillator
//!
//! Bypasses the HFXT crystal oscillator, which supports crystal frequencies
//! between 0 MHz and 24 MHz. Loops until all oscillator fault flags are
//! cleared, with no timeout.NOTE: User must call CS_setExternalClockSource to
//! set frequency of external clocks before calling this function.
//!
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG register.
//!
//! \return None
//
//*****************************************************************************
void CS_bypassHFXT(void)
{
        //Verify user has initialized value of HFXTClock
        assert(CS_HFXTClockFrequency != 0);

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        //Switch off HFXT oscillator and set it to BYPASS mode
        HWREG16(CS_BASE + OFS_CSCTL4) |= ( HFXTBYPASS + HFXTOFF );

        //Set correct HFFREQ bit for FR58xx/FR59xx devices

        //If HFFrequency is 16MHz or above
        if (CS_HFXTClockFrequency > 16000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_3;
        //If HFFrequency is between 8MHz and 16MHz
        else if (CS_HFXTClockFrequency > 8000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_2;
        //If HFFrequency is between 0MHz and 4MHz
        else if (CS_HFXTClockFrequency < 4000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_0;
        //If HFFrequency is between 4MHz and 8MHz
        else
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_1;

        while (HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) {
                //Clear OSC fault Flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

                //Clear OFIFG fault flag
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes the HFXT crystal oscillator with timeout.
//!
//! Initializes the HFXT crystal oscillator, which supports crystal frequencies
//! between 0 MHz and 24 MHz, depending on the selected drive strength. Loops
//! until all oscillator fault flags are cleared or until a timeout counter is
//! decremented and equals to zero. See the device-specific data sheet for
//! appropriate drive settings. NOTE: User must call CS_setExternalClockSource
//! to set frequency of external clocks before calling this function.
//!
//! \param hfxtdrive is the target drive strength for the HFXT crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_HFXTDRIVE_4MHZ_8MHZ
//!        - \b CS_HFXTDRIVE_8MHZ_16MHZ
//!        - \b CS_HFXTDRIVE_16MHZ_24MHZ
//!        - \b CS_HFXTDRIVE_24MHZ_32MHZ [Default]
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_HFXTStartWithTimeout(uint16_t hfxtdrive,
                             uint32_t timeout
                             )
{
        //Verify user has initialized value of HFXTClock
        assert(CS_HFXTClockFrequency != 0);

        assert(timeout > 0);

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        // Disable HFXTBYPASS mode
        HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTBYPASS;

        //Set correct HFFREQ bit for FR58xx/FR59xx devices based
        //on HFXTClockFrequency

        //If HFFrequency is 16MHz or above
        if (CS_HFXTClockFrequency > 16000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_3;
        //If HFFrequency is between 8MHz and 16MHz
        else if (CS_HFXTClockFrequency > 8000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_2;
        //If HFFrequency is between 0MHz and 4MHz
        else if (CS_HFXTClockFrequency < 4000000)
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_0;
        //If HFFrequency is between 4MHz and 8MHz
        else
                HWREG16(CS_BASE + OFS_CSCTL4) = HFFREQ_1;

        while ((HWREG8(CS_BASE + OFS_CSCTL5) & HFXTOFFG) && --timeout) {
                //Clear OSC fault Flags fault flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(HFXTOFFG);

                // Clear the global fault flag. In case the LFXT caused the global fault
                // flag to get set this will clear the global error condition. If any
                // error condition persists, global flag will get again.
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

        }

        if (timeout) {
                //Set drive strength for HFXT
                HWREG16(CS_BASE + OFS_CSCTL4) = ( HWREG16(CS_BASE + OFS_CSCTL4) &
                                                  ~(CS_HFXTDRIVE_24MHZ_32MHZ)
                                                  ) |
                                                (hfxtdrive);

                //Switch on HFXT oscillator
                HWREG16(CS_BASE + OFS_CSCTL4) &= ~HFXTOFF;
                // Lock CS control register
                HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
                return STATUS_SUCCESS;
        } else {
                // Lock CS control register
                HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
                return STATUS_FAIL;
        }
}

//*****************************************************************************
//
//! \brief Bypasses the HFXT crustal oscillator with timeout
//!
//! Bypasses the HFXT crystal oscillator, which supports crystal frequencies
//! between 0 MHz and 24 MHz. Loops until all oscillator fault flags are
//! cleared or until a timeout counter is decremented and equals to zero. NOTE:
//! User must call CS_setExternalClockSource to set frequency of external
//! clocks before calling this function.
//!
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register, bits of \b CSCTL4 register and bits of
//! \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL
//
//*****************************************************************************
bool CS_bypassHFXTWithTimeout(uint32_t timeout
                              )
{
        //Verify user has initialized value of HFXTClock
        assert(CS_HFXTClockFrequency != 0);

        assert(timeout > 0);

