ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/cs.c
        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        HWREG8(CS_BASE + OFS_CSCTL5) &= ~mask;

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Get the current ACLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case LFXT or HFXT is
//! being used.
//!
//!
//! \return Current ACLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getACLK(void)
{

        //Find ACLK source
        uint16_t ACLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELA_7);

        ACLKSource = ACLKSource >> 8;

        //Find ACLK frequency divider
        uint16_t ACLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL3) & SELA_7;
        ACLKSourceDivider = ACLKSourceDivider >> 8;

        return privateCSAComputeCLKFrequency(
                       ACLKSource,
                       ACLKSourceDivider);

}

//*****************************************************************************
//
//! \brief Get the current SMCLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case LFXT or HFXT is
//! being used.
//!
//!
//! \return Current SMCLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getSMCLK(void)
{
        //Find SMCLK source
        uint16_t SMCLKSource = HWREG8(CS_BASE + OFS_CSCTL2) & SELS_7;

        SMCLKSource = SMCLKSource >> 4;

        //Find SMCLK frequency divider
        uint16_t SMCLKSourceDivider = HWREG16(CS_BASE + OFS_CSCTL3) & SELS_7;
        SMCLKSourceDivider = SMCLKSourceDivider >> 4;

        return privateCSAComputeCLKFrequency(
                       SMCLKSource,
                       SMCLKSourceDivider )
        ;
}

//*****************************************************************************
//
//! \brief Get the current MCLK frequency.
//!
//! If a oscillator fault is set, the frequency returned will be based on the
//! fail safe mechanism of CS module. The user of this API must ensure that
//! CS_externalClockSourceInit API was invoked before in case LFXT or HFXT is
//! being used.
//!
//!
//! \return Current MCLK frequency in Hz
//
//*****************************************************************************
uint32_t CS_getMCLK(void)
{
        //Find MCLK source
        uint16_t MCLKSource = (HWREG16(CS_BASE + OFS_CSCTL2) & SELM_7);
        //Find MCLK frequency divider
        uint16_t MCLKSourceDivider =  HWREG16(CS_BASE + OFS_CSCTL3) & SELM_7;

        return privateCSAComputeCLKFrequency(
                       MCLKSource,
                       MCLKSourceDivider )
        ;
}

//*****************************************************************************
//
//! \brief Turns off VLO
//!
//!
//! Modified bits of \b CSCTL4 register.
//!
//! \return None
//
//*****************************************************************************
void CS_VLOoff(void)
{
        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        HWREG16(CS_BASE + OFS_CSCTL4) |= VLOOFF;

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Clears all the Oscillator Flags
//!
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL5 register and bits of \b SFRIFG1 register.
//!
//! \return the mask of the oscillator flag status
//
//*****************************************************************************
uint16_t CS_clearAllOscFlagsWithTimeout(uint32_t timeout)
{
        assert(timeout > 0);

        // Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        do {
                // Clear all osc fault flags
                HWREG8(CS_BASE + OFS_CSCTL5) &= ~(LFXTOFFG + HFXTOFFG );

                // Clear the global osc fault flag.
                HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

                // Check LFXT fault flags
        } while ((HWREG8(SFR_BASE + OFS_SFRIFG1) & OFIFG) && --timeout);

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;

        return HWREG8(CS_BASE + OFS_CSCTL5) & (LFXTOFFG + HFXTOFFG);
}

//*****************************************************************************
//
//! \brief Set DCO frequency
//!
//! \param dcorsel selects frequency range option.
//!        Valid values are:
//!        - \b CS_DCORSEL_0 [Default] - Low Frequency Option
//!        - \b CS_DCORSEL_1 - High Frequency Option
//! \param dcofsel selects valid frequency options based on dco frequency range
//!        selection (dcorsel)
//!        Valid values are:
//!        - \b CS_DCOFSEL_0 - Low frequency option 1MHz. High frequency option
//!           1MHz.
//!        - \b CS_DCOFSEL_1 - Low frequency option 2.67MHz. High frequency
//!           option 5.33MHz.
//!        - \b CS_DCOFSEL_2 - Low frequency option 3.33MHz. High frequency
//!           option 6.67MHz.
//!        - \b CS_DCOFSEL_3 - Low frequency option 4MHz. High frequency option
//!           8MHz.
//!        - \b CS_DCOFSEL_4 - Low frequency option 5.33MHz. High frequency
//!           option 16MHz.
//!        - \b CS_DCOFSEL_5 - Low frequency option 6.67MHz. High frequency
//!           option 20MHz.
//!        - \b CS_DCOFSEL_6 - Low frequency option 8MHz. High frequency option
//!           24MHz.
//!
//! \return None
//
//*****************************************************************************
void CS_setDCOFreq(uint16_t dcorsel,
                   uint16_t dcofsel)
{
        assert(
                (dcofsel == CS_DCOFSEL_0) ||
                (dcofsel == CS_DCOFSEL_1) ||
                (dcofsel == CS_DCOFSEL_2) ||
                (dcofsel == CS_DCOFSEL_3) ||
                (dcofsel == CS_DCOFSEL_4) ||
                (dcofsel == CS_DCOFSEL_5) ||
                (dcofsel == CS_DCOFSEL_6)
                );

        //Verify user has selected a valid DCO Frequency Range option
        assert(
                (dcorsel == CS_DCORSEL_0) ||
                (dcorsel == CS_DCORSEL_1));

        //Unlock CS control register
        HWREG16(CS_BASE + OFS_CSCTL0) = CSKEY;

        // Set user's frequency selection for DCO
        HWREG16(CS_BASE + OFS_CSCTL1) = (dcorsel + dcofsel);

        // Lock CS control register
        HWREG8(CS_BASE + OFS_CSCTL0_H) = 0x00;
}

#endif
#endif
//*****************************************************************************
//
//! Close the doxygen group for cs_api
//! @}
//
//*****************************************************************************
